{
  "Linguagens": {
    "competencias_especificas_area": [],
    "componentes": {
      "Língua Portuguesa": {
        "competencias_especificas_componente": [],
        "anos": {
          "2º Ano": {
            "Análise linguística/semiótica (Alfabetização)": {
              "(EF01LP03) Observar escritas convencionais, comparando-as às suas produções escritas, percebendo semelhanças e diferenças.": [
                {
                  "codigo": "EF02LP01",
                  "descricao": "Utilizar, ao produzir o texto, grafia correta de palavras conhecidas ou com estruturas silábicas já dominadas, letras maiúsculas em início de frases e em substantivos próprios, segmentação entre as palavras, ponto final, ponto de interrogação e ponto de exclamação."
                }
              ],
              "(EF01LP06) Segmentar oralmente palavras em sílabas.": [
                {
                  "codigo": "EF02LP02",
                  "descricao": "Segmentar palavras em sílabas e remover e substituir sílabas iniciais, mediais ou finais para criar novas palavras."
                }
              ],
              "(EF01LP07) Identificar fonemas e sua representação por letras.": [
                {
                  "codigo": "EF02LP03",
                  "descricao": "Ler e escrever palavras com correspondências regulares diretas entre letras e fonemas (f, v, t, d, p, b) e correspondências regulares contextuais (c e q; e e o, em posição átona em final de palavra)."
                }
              ],
              "(EF01LP08) Relacionar elementos sonoros (sílabas, fonemas, partes de palavras) com sua representação escrita.": [
                {
                  "codigo": "EF02LP04",
                  "descricao": "Ler e escrever corretamente palavras com sílabas CV, V, CVC, CCV, identificando que existem vogais em todas as sílabas."
                }
              ],
              "(EF01LP09) Comparar palavras, identificando semelhanças e diferenças entre sons de sílabas iniciais.": [
                {
                  "codigo": "EF02LP05",
                  "descricao": "Ler e escrever corretamente palavras com marcas de nasalidade (til, m, n)."
                }
              ],
              "(EF01LP10) Nomear as letras do alfabeto e recitá-lo na ordem das letras.": [
                {
                  "codigo": "EF02LP06",
                  "descricao": "Perceber o princípio acrofônico que opera nos nomes das letras do alfabeto."
                }
              ],
              "(EF01LP11) Conhecer, diferenciar e relacionar letras em formato imprensa e cursiva, maiúsculas e minúsculas.": [
                {
                  "codigo": "EF02LP07",
                  "descricao": "Escrever palavras, frases, textos curtos nas formas imprensa e cursiva."
                }
              ],
              "(EF01LP12) Reconhecer a separação das palavras, na escrita, por espaços em branco.": [
                {
                  "codigo": "EF02LP08",
                  "descricao": "Segmentar corretamente as palavras ao escrever frases e textos."
                }
              ],
              "(EF01LP14) Identificar outros sinais no texto além das letras, como pontos finais, de interrogação e exclamação e seus efeitos na entonação.": [
                {
                  "codigo": "EF02LP09",
                  "descricao": "Usar adequadamente ponto final, ponto de interrogação e ponto de exclamação."
                }
              ],
              "(EF01LP15) Agrupar palavras pelo critério de aproximação de significado (sinonímia) e separar palavras pelo critério de oposição de significado (antonímia).": [
                {
                  "codigo": "EF02LP10",
                  "descricao": "Identificar sinônimos de palavras de texto lido, determinando a diferença de sentido entre eles, e formar antônimos de palavras encontradas em texto lido pelo acréscimo do prefixo de negação in-/im-."
                },
                {
                  "codigo": "EF02LP11",
                  "descricao": "Formar o aumentativo e o diminutivo de palavras com os sufixos -ão e -inho/-zinho."
                }
              ],
              "(EF01LP21) Escrever, em colaboração com os colegas e com a ajuda do professor, listas de regras e regulamentos que organizam a vida na comunidade escolar, dentre outros gêneros do campo da atuação cidadã, considerando a situação comunicativa e o tema/assunto do texto.": [
                {
                  "codigo": "EF02LP18",
                  "descricao": "Planejar e produzir cartazes e folhetos para divulgar eventos da escola ou da comunidade, utilizando linguagem persuasiva e elementos textuais e visuais (tamanho da letra, leiaute, imagens) adequados ao gênero, considerando a situação comunicativa e o tema/assunto do texto."
                },
                {
                  "codigo": "EF02LP19",
                  "descricao": "Planejar e produzir, em colaboração com os colegas e com a ajuda do professor, notícias curtas para público infantil, para compor jornal falado que possa ser repassado oralmente ou em meio digital, em áudio ou vídeo, dentre outros gêneros do campo jornalístico, considerando a situação comunicativa e o tema/assunto do texto."
                }
              ],
              "(EF01LP24) Identificar e reproduzir, em enunciados de tarefas escolares, diagramas, entrevistas, curiosidades, digitais ou impressos, a formatação e diagramação específica de cada um desses gêneros, inclusive em suas versões orais.": [
                {
                  "codigo": "EF02LP25",
                  "descricao": "Identificar e reproduzir, em relatos de experimentos, entrevistas, verbetes de enciclopédia infantil, digitais ou impressos, a formatação e diagramação específica de cada um desses gêneros, inclusive em suas versões orais."
                },
                {
                  "codigo": "EF02LP26",
                  "descricao": "Ler e compreender, com certa autonomia, textos literários, de gêneros variados, desenvolvendo o gosto pela leitura."
                }
              ],
              "(EF01LP25) Produzir, tendo o professor como escriba, recontagens de histórias lidas pelo professor, histórias imaginadas ou baseadas em livros de imagens, observando a forma de composição de textos narrativos (personagens, enredo, tempo e espaço).": [
                {
                  "codigo": "EF02LP27",
                  "descricao": "Reescrever textos narrativos literários lidos pelo professor."
                }
              ],
              "(EF01LP26) Identificar elementos de uma narrativa lida ou escutada, incluindo personagens, enredo, tempo e espaço.": [
                {
                  "codigo": "EF02LP28",
                  "descricao": "Reconhecer o conflito gerador de uma narrativa ficcional e sua resolução, além de palavras, expressões e frases que caracterizam personagens e ambientes."
                }
              ],
              "(EF12LP19) Reconhecer, em textos versificados, rimas, sonoridades, jogos de palavras, palavras, expressões, comparações, relacionando-as com sensações e associações.": [
                {
                  "codigo": "EF02LP29",
                  "descricao": "Observar, em poemas visuais, o formato do texto na página, as ilustrações e outros efeitos visuais."
                }
              ]
            },
            "Oralidade": {
              "(EF01LP16) Ler e compreender, em colaboração com os colegas e com a ajuda do professor, quadras, quadrinhas, parlendas, trava-línguas, dentre outros gêneros do campo da vida cotidiana, considerando a situação comunicativa e o tema/assunto do texto e relacionando sua forma de organização à sua finalidade.": [
                {
                  "codigo": "EF02LP12",
                  "descricao": "Ler e compreender com certa autonomia cantigas, letras de canção, dentre outros gêneros do campo da vida cotidiana, considerando a situação comunicativa e o tema/assunto do texto e relacionando sua forma de organização à sua finalidade."
                }
              ],
              "(EF01LP17) Planejar e produzir, em colaboração com os colegas e com a ajuda do professor, listas, agendas, calendários, avisos, convites, receitas, instruções de montagem e legendas para álbuns, fotos ou ilustrações (digitais ou impressos), dentre outros gêneros do campo da vida cotidiana, considerando a situação comunicativa e o tema/assunto/ finalidade do texto.": [
                {
                  "codigo": "EF02LP13",
                  "descricao": "Planejar e produzir bilhetes e cartas, em meio impresso e/ou digital, dentre outros gêneros do campo da vida cotidiana, considerando a situação comunicativa e o tema/assunto/finalidade do texto."
                }
              ],
              "(EF01LP18) Registrar, em colaboração com os colegas e com a ajuda do professor, cantigas, quadras, quadrinhas, parlendas, trava-línguas, dentre outros gêneros do campo da vida cotidiana, considerando a situação comunicativa e o tema/assunto/finalidade do texto.": [
                {
                  "codigo": "EF02LP14",
                  "descricao": "Planejar e produzir pequenos relatos de observação de processos, de fatos, de experiências pessoais, mantendo as características do gênero, considerando a situação comunicativa e o tema/assunto do texto."
                }
              ],
              "(EF01LP19) Recitar parlendas, quadras, quadrinhas, trava-línguas, com entonação adequada e observando as rimas.": [
                {
                  "codigo": "EF02LP15",
                  "descricao": "Cantar cantigas e canções, obedecendo ao ritmo e à melodia."
                }
              ],
              "(EF12LP17) Ler e compreender, em colaboração com os colegas e com a ajuda do professor, enunciados de tarefas escolares, diagramas, curiosidades, pequenos relatos de experimentos, entrevistas, verbetes de enciclopédia infantil, entre outros gêneros do campo investigativo, considerando a situação comunicativa e o tema/assunto do texto.": [
                {
                  "codigo": "EF02LP20",
                  "descricao": "Reconhecer a função de textos utilizados para apresentar informações coletadas em atividades de pesquisa (enquetes, pequenas entrevistas, registros de experimentações)."
                },
                {
                  "codigo": "EF02LP21",
                  "descricao": "Explorar, com a mediação do professor, textos informativos de diferentes ambientes digitais de pesquisa, conhecendo suas possibilidades."
                }
              ],
              "(EF01LP22) Planejar e produzir, em colaboração com os colegas e com a ajuda do professor, diagramas, entrevistas, curiosidades, dentre outros gêneros do campo investigativo, digitais ou impressos, considerando a situação comunicativa e o tema/assunto/finalidade do texto.": [
                {
                  "codigo": "EF02LP22",
                  "descricao": "Planejar e produzir, em colaboração com os colegas e com a ajuda do professor, pequenos relatos de experimentos, entrevistas, verbetes de enciclopédia infantil, dentre outros gêneros do campo investigativo, digitais ou impressos, considerando a situação comunicativa e o tema/assunto/finalidade do texto."
                },
                {
                  "codigo": "EF02LP23",
                  "descricao": "Planejar e produzir, com certa autonomia, pequenos registros de observação de resultados de pesquisa, coerentes com um tema investigado."
                }
              ],
              "(EF01LP23) Planejar e produzir, em colaboração com os colegas e com a ajuda do professor, entrevistas, curiosidades, dentre outros gêneros do campo investigativo, que possam ser repassados oralmente por meio de ferramentas digitais, em áudio ou vídeo, considerando a situação comunicativa e o tema/assunto/finalidade do texto.": [
                {
                  "codigo": "EF02LP24",
                  "descricao": "Planejar e produzir, em colaboração com os colegas e com a ajuda do professor, relatos de experimentos, registros de observação, entrevistas, dentre outros gêneros do campo investigativo, que possam ser repassados oralmente por meio de ferramentas digitais, em áudio ou vídeo, considerando a situação comunicativa e o tema/assunto/ finalidade do texto."
                }
              ]
            },
            "Leitura/escuta (compartilhada e autônoma)": {
              "(EF01LP20) Identificar e reproduzir, em listas, agendas, calendários, regras, avisos, convites, receitas, instruções de montagem e legendas para álbuns, fotos ou ilustrações (digitais ou impressos), a formatação e diagramação específica de cada um desses gêneros.": [
                {
                  "codigo": "EF02LP16",
                  "descricao": "Identificar e reproduzir, em bilhetes, recados, avisos, cartas, e-mails, receitas (modo de fazer), relatos (digitais ou impressos), a formatação e diagramação específica de cada um desses gêneros."
                },
                {
                  "codigo": "EF02LP17",
                  "descricao": "Identificar e reproduzir, em relatos de experiências pessoais, a sequência dos fatos, utilizando expressões que marquem a passagem do tempo (“antes”, “depois”, “ontem”, “hoje”, “amanhã”, “outro dia”, “antigamente”, “há muito tempo” etc.), e o nível de informatividade necessário."
                }
              ]
            }
          },
          "5º Ano": {
            "Análise linguística/semiótica (Ortografização)": {
              "(EF04LP01) Grafar palavras utilizando regras de correspondência fonema- -grafema regulares diretas e contextuais.": [
                {
                  "codigo": "EF05LP01",
                  "descricao": "Grafar palavras utilizando regras de correspondência fonema- -grafema regulares, contextuais emorfológicas e palavras de uso frequente com correspondências irregulares."
                }
              ],
              "(EF04LP03) Localizar palavras no dicionário para esclarecer significados, reconhecendo o significado mais plausível para o contexto que deu origem à consulta.": [
                {
                  "codigo": "EF05LP02",
                  "descricao": "Identificar o caráter polissêmico das palavras (uma mesma palavra com diferentes significados, de acordo com o contexto de uso), comparando o significado de determinados termos utilizados nas áreas científicas com esses mesmos termos utilizados na linguagem usual."
                }
              ],
              "(EF04LP04) Usar acento gráfico (agudo ou circunflexo) em paroxítonas terminadas em -i(s), -l, -r, -ão(s).": [
                {
                  "codigo": "EF05LP03",
                  "descricao": "Acentuar corretamente palavras oxítonas, paroxítonas e proparoxítonas."
                }
              ],
              "(EF04LP05) Identificar a função na leitura e usar, adequadamente, na escrita ponto final, de interrogação, de exclamação, dois-pontos e travessão em diálogos (discurso direto), vírgula em enumerações e em separação de vocativo e de aposto.": [
                {
                  "codigo": "EF05LP04",
                  "descricao": "Diferenciar, na leitura de textos, vírgula, ponto e vírgula, dois-pontos e reconhecer, na leitura de textos, o efeito de sentido que decorre do uso de reticências, aspas, parênteses."
                },
                {
                  "codigo": "EF05LP05",
                  "descricao": "Identificar a expressão de presente, passado e futuro em tempos verbais do modo indicativo."
                }
              ],
              "(EF04LP06) Identificar em textos e usar na produção textual a concordância entre substantivo ou pronome pessoal e verbo (concordância verbal).": [
                {
                  "codigo": "EF05LP06",
                  "descricao": "Flexionar, adequadamente, na escrita e na oralidade, os verbos em concordância com pronomes pessoais/nomes sujeitos da oração."
                }
              ],
              "(EF04LP17) Produzir jornais radiofônicos ou televisivos e entrevistas veiculadas em rádio, TV e na internet, orientando-se por roteiro ou texto e demonstrando conhecimento dos gêneros jornal falado/televisivo e entrevista.": [
                {
                  "codigo": "EF05LP18",
                  "descricao": "Roteirizar, produzir e editar vídeo para vlogs argumentativos sobre produtos de mídia para público infantil (filmes, desenhos animados, HQs, games etc.), com base em conhecimentos sobre os mesmos, de acordo com as convenções do gênero e considerando a situação comunicativa e o tema/ assunto/finalidade do texto."
                },
                {
                  "codigo": "EF05LP19",
                  "descricao": "Argumentar oralmente sobre acontecimentos de interesse social, com base em conhecimentos sobre fatos divulgados em TV, rádio, mídia impressa e digital, respeitando pontos de vista diferentes."
                },
                {
                  "codigo": "EF05LP20",
                  "descricao": "Analisar a validade e força de argumentos em argumentações sobre produtos de mídia para público infantil (filmes, desenhos animados, HQs, games etc.), com base em conhecimentos sobre os mesmos."
                }
              ],
              "(EF04LP18) Analisar o padrão entonacional e a expressão facial e corporal de âncoras de jornais radiofônicos ou televisivos e de entrevistadores/entrevistados.": [
                {
                  "codigo": "EF05LP21",
                  "descricao": "Analisar o padrão entonacional, a expressão facial e corporal e as escolhas de variedade e registro linguísticos de vloggers de vlogs opinativos ou argumentativos."
                }
              ],
              "4o ANO": [
                {
                  "codigo": "EF05LP26",
                  "descricao": "Utilizar, ao produzir o texto, conhecimentos linguísticos e gramaticais: regras sintáticas de concordância nominal e verbal, convenções de escrita de citações, pontuação (ponto final, dois-pontos, vírgulas em enumerações) e regras ortográficas."
                }
              ],
              "(EF04LP23) Identificar e reproduzir, em verbetes de enciclopédia infantil, digitais ou impressos, a formatação e diagramação específica desse gênero (título do verbete, definição, detalhamento, curiosidades), considerando a situação comunicativa e o tema/ assunto/finalidade do texto.": [
                {
                  "codigo": "EF05LP27",
                  "descricao": "Utilizar, ao produzir o texto, recursos de coesão pronominal (pronomes anafóricos) e articuladores de relações de sentido (tempo, causa, oposição, conclusão, comparação), com nível adequado de informatividade."
                }
              ],
              "(EF04LP26) Observar, em poemas concretos, o formato, a distribuição e a diagramação das letras do texto na página.": [
                {
                  "codigo": "EF05LP28",
                  "descricao": "Observar, em ciberpoemas e minicontos infantis em mídia digital, os recursos multissemióticos presentes nesses textos digitais."
                }
              ]
            },
            "Leitura/escuta (compartilhada e autônoma)": {
              "(EF04LP07) Identificar em textos e usar na produção textual a concordância entre artigo, substantivo e adjetivo (concordância no grupo nominal).": [
                {
                  "codigo": "EF05LP07",
                  "descricao": "Identificar, em textos, o uso de conjunções e a relação que estabelecem entre partes do texto: adição, oposição, tempo, causa, condição, finalidade."
                }
              ],
              "(EF04LP08) Reconhecer e grafar, corretamente, palavras derivadas com os sufixos -agem, -oso, -eza, -izar/-isar (regulares morfológicas).": [
                {
                  "codigo": "EF05LP08",
                  "descricao": "Diferenciar palavras primitivas, derivadas e compostas, e derivadas por adição de prefixo e de sufixo."
                }
              ],
              "(EF04LP09) Ler e compreender, com autonomia, boletos, faturas e carnês, dentre outros gêneros do campo da vida cotidiana, de acordo com as convenções do gênero (campos, itens elencados, medidas de consumo, código de barras) e considerando a situação comunicativa e a finalidade do texto.": [
                {
                  "codigo": "EF05LP09",
                  "descricao": "Ler e compreender, com autonomia, textos instrucional de regras de jogo, dentre outros gêneros do campo da vida cotidiana, de acordo com as convenções do gênero e considerando a situação comunicativa e a finalidade do texto."
                }
              ],
              "(EF04LP13) Identificar e reproduzir, em textos injuntivos instrucionais (instruções de jogos digitais ou impressos), a formatação própria desses textos (verbos imperativos, indicação de passos a ser seguidos) e formato específico dos textos orais ou escritos desses gêneros (lista/ apresentação de materiais e instruções/passos de jogo).": [
                {
                  "codigo": "EF05LP14",
                  "descricao": "Identificar e reproduzir, em textos de resenha crítica de brinquedos ou livros de literatura infantil, a formatação própria desses textos (apresentação e avaliação do produto)."
                }
              ],
              "(EF04LP14) Identificar, em notícias, fatos, participantes, local e momento/tempo da ocorrência do fato noticiado.": [
                {
                  "codigo": "EF05LP15",
                  "descricao": "Ler/assistir e compreender, com autonomia, notícias, reportagens, vídeos em vlogs argumentativos, dentre outros gêneros do campo político-cidadão, de acordo com as convenções dos gêneros e considerando a situação comunicativa e o tema/assunto do texto."
                }
              ]
            },
            "Oralidade": {
              "(EF04LP10) Ler e compreender, com autonomia, cartas pessoais de reclamação, dentre outros gêneros do campo da vida cotidiana, de acordo com as convenções do gênero carta e considerando a situação comunicativa e o tema/assunto/finalidade do texto.": [
                {
                  "codigo": "EF05LP10",
                  "descricao": "Ler e compreender, com autonomia, anedotas, piadas e cartuns, dentre outros gêneros do campo da vida cotidiana, de acordo com as convenções do gênero e considerando a situação comunicativa e a finalidade do texto."
                }
              ],
              "(EF04LP11) Planejar e produzir, com autonomia, cartas pessoais de reclamação, dentre outros gêneros do campo da vida cotidiana, de acordo com as convenções do gênero carta e com a estrutura própria desses textos (problema, opinião, argumentos), considerando a situação comunicativa e o tema/assunto/finalidade do texto.": [
                {
                  "codigo": "EF05LP11",
                  "descricao": "Registrar, com autonomia, anedotas, piadas e cartuns, dentre outros gêneros do campo da vida cotidiana, de acordo com as convenções do gênero e considerando a situação comunicativa e a finalidade do texto."
                },
                {
                  "codigo": "EF05LP12",
                  "descricao": "Planejar e produzir, com autonomia, textos instrucionais de regras de jogo, dentre outros gêneros do campo da vida cotidiana, de acordo com as convenções do gênero e considerando a situação comunicativa e a finalidade do texto."
                }
              ],
              "(EF04LP12) Assistir, em vídeo digital, a programa infantil com instruções de montagem, de jogos e brincadeiras e, a partir dele, planejar e produzir tutoriais em áudio ou vídeo.": [
                {
                  "codigo": "EF05LP13",
                  "descricao": "Assistir, em vídeo digital, a postagem de vlog infantil de críticas de brinquedos e livros de literatura infantil e, a partir dele, planejar e produzir resenhas digitais em áudio ou vídeo."
                }
              ]
            },
            "Produção de textos (escrita compartilhada e autônoma)": {
              "(EF04LP15) Distinguir fatos de opiniões/sugestões em textos (informativos, jornalísticos, publicitários etc.).": [
                {
                  "codigo": "EF05LP16",
                  "descricao": "Comparar informações sobre um mesmo fato veiculadas em diferentes mídias e concluir sobre qual é mais confiável e por quê."
                }
              ],
              "(EF04LP16) Produzir notícias sobre fatos ocorridos no universo escolar, digitais ou impressas, para o jornal da escola, noticiando os fatos e seus atores e comentando decorrências, de acordo com as convenções do gênero notícia e considerando a situação comunicativa e o tema/assunto do texto.": [
                {
                  "codigo": "EF05LP17",
                  "descricao": "Produzir roteiro para edição de uma reportagem digital sobre temas de interesse da turma, a partir de buscas de informações, imagens, áudios e vídeos na internet, de acordo com as convenções do gênero e considerando a situação comunicativa e o tema/assunto do texto."
                }
              ],
              "(EF04LP19) Ler e compreender textos expositivos de divulgação científica para crianças, considerando a situação comunicativa e o tema/ assunto do texto.": [
                {
                  "codigo": "EF05LP22",
                  "descricao": "Ler e compreender verbetes de dicionário, identificando a estrutura, as informações gramaticais (significado de abreviaturas) e as informações semânticas."
                }
              ],
              "(EF04LP20) Reconhecer a função de gráficos, diagramas e tabelas em textos, como forma de apresentação de dados e informações.": [
                {
                  "codigo": "EF05LP23",
                  "descricao": "Comparar informações apresentadas em gráficos ou tabelas."
                }
              ],
              "(EF04LP21) Planejar e produzir textos sobre temas de interesse, com base em resultados de observações e pesquisas em fontes de informações impressas ou eletrônicas, incluindo, quando pertinente, imagens e gráficos ou tabelas simples, considerando a situação comunicativa e o tema/assunto do texto.": [
                {
                  "codigo": "EF05LP24",
                  "descricao": "Planejar e produzir texto sobre tema de interesse, organizando resultados de pesquisa em fontes de informação impressas ou digitais, incluindo imagens e gráficos ou tabelas, considerando a situação comunicativa e o tema/assunto do texto."
                }
              ],
              "(EF04LP22) Planejar e produzir, com certa autonomia, verbetes de enciclopédia infantil, digitais ou impressos, considerando a situação comunicativa e o tema/ assunto/finalidade do texto.": [
                {
                  "codigo": "EF05LP25",
                  "descricao": "Planejar e produzir, com certa autonomia, verbetes de dicionário, digitais ou impressos, considerando a situação comunicativa e o tema/assunto/finalidade do texto."
                }
              ]
            }
          },
          "7º Ano": {
            "Leitura": {
              "(EF06LP01) Reconhecer a impossibilidade de uma neutralidade absoluta no relato de fatos e identificar diferentes graus de parcialidade/ imparcialidade dados pelo recorte feito e pelos efeitos de sentido advindos de escolhas feitas pelo autor, de forma a poder desenvolver uma atitude crítica frente aos textos jornalísticos e tornar-se consciente das escolhas feitas enquanto produtor de textos.": [
                {
                  "codigo": "EF07LP01",
                  "descricao": "Distinguir diferentes propostas editoriais – sensacionalismo, jornalismo investigativo etc. –, de forma a identificar os recursos utilizados para impactar/chocar o leitor que podem comprometer uma análise crítica da notícia e do fato noticiado."
                }
              ],
              "(EF06LP02) Estabelecer relação entre os diferentes gêneros jornalísticos, compreendendo a centralidade da notícia.": [
                {
                  "codigo": "EF07LP02",
                  "descricao": "Comparar notícias e reportagens sobre um mesmo fato divulgadas em diferentes mídias, analisando as especificidades das mídias, os processos de (re)elaboração dos textos e a convergência das mídias em notícias ou reportagens multissemióticas."
                }
              ]
            },
            "Análise linguística/semiótica": {
              "(EF06LP03) Analisar diferenças de sentido entre palavras de uma série sinonímica.": [
                {
                  "codigo": "EF07LP03",
                  "descricao": "Formar, com base em palavras primitivas, palavras derivadas com os prefixos e sufixos mais produtivos no português."
                }
              ],
              "(EF06LP04) Analisar a função e as flexões de substantivos e adjetivos e de verbos nos modos Indicativo, Subjuntivo e Imperativo: afirmativo e negativo.": [
                {
                  "codigo": "EF07LP04",
                  "descricao": "Reconhecer, em textos, o verbo como o núcleo das orações."
                }
              ],
              "(EF06LP05) Identificar os efeitos de sentido dos modos verbais, considerando o gênero textual e a intenção comunicativa.": [
                {
                  "codigo": "EF07LP05",
                  "descricao": "Identificar, em orações de textos lidos ou de produção própria, verbos de predicação completa e incompleta: intransitivos e transitivos."
                }
              ],
              "(EF06LP06) Empregar, adequadamente, as regras de concordância nominal (relações entre os substantivos e seus determinantes) e as regras de concordância verbal (relações entre o verbo e o sujeito simples e composto).": [
                {
                  "codigo": "EF07LP06",
                  "descricao": "Empregar as regras básicas de concordância nominal e verbal em situações comunicativas e na produção de textos."
                },
                {
                  "codigo": "EF07LP07",
                  "descricao": "Identificar, em textos lidos ou de produção própria, a estrutura básica da oração: sujeito, predicado, complemento (objetos direto e indireto)."
                }
              ],
              "6o ANO": [
                {
                  "codigo": "EF07LP08",
                  "descricao": "Identificar, em textos lidos ou de produção própria, adjetivos que ampliam o sentido do substantivo sujeito ou complemento verbal."
                },
                {
                  "codigo": "EF07LP09",
                  "descricao": "Identificar, em textos lidos ou de produção própria, advérbios e locuções adverbiais que ampliam o sentido do verbo núcleo da oração."
                }
              ],
              "(EF06LP08) Identificar, em texto ou sequência textual, orações como unidades constituídas em torno de um núcleo verbal e períodos como conjunto de orações conectadas.": [
                {
                  "codigo": "EF07LP10",
                  "descricao": "Utilizar, ao produzir texto, conhecimentos linguísticos e gramaticais: modos e tempos verbais, concordância nominal e verbal, pontuação etc."
                }
              ],
              "(EF06LP09) Classificar, em texto ou sequência textual, os períodos simples compostos.": [
                {
                  "codigo": "EF07LP11",
                  "descricao": "Identificar,em textos lidos ou de produção própria, períodos compostos nos quais duas orações são conectadas por vírgula, ou por conjunções que expressem soma de sentido (conjunção “e”) ou oposição de sentidos (conjunções “mas”, “porém”)."
                }
              ],
              "(EF06LP12) Utilizar, ao produzir texto, recursos de coesão referencial (nome e pronomes), recursos semânticos de sinonímia, antonímia e homonímia e mecanismos de representação de diferentes vozes (discurso direto e indireto).": [
                {
                  "codigo": "EF07LP12",
                  "descricao": "Reconhecer recursos de coesão referencial: substituições lexicais (de substantivos por sinônimos) ou pronominais (uso de pronomes anafóricos – pessoais, possessivos, demonstrativos)."
                }
              ],
              "(EF67LP36) Utilizar, ao produzir texto, recursos de coesão referencial (léxica e pronominal) e sequencial e outros recursos expressivos adequados ao gênero textual.": [
                {
                  "codigo": "EF07LP13",
                  "descricao": "Estabelecer relações entre partes do texto, identificando substituições lexicais (de substantivos por sinônimos) ou pronominais (uso de pronomes anafóricos – pessoais, possessivos, demonstrativos), que contribuem para a continuidade do texto."
                }
              ],
              "(EF67LP37) Analisar, em diferentes textos, os efeitos de sentido decorrentes do uso de recursos linguístico-discursivos de prescrição, causalidade, sequências descritivas e expositivas e ordenação de eventos.": [
                {
                  "codigo": "EF07LP14",
                  "descricao": "Identificar, em textos, os efeitos de sentido do uso de estratégias de modalização e argumentatividade."
                }
              ]
            }
          },
          "9º Ano": {
            "Leitura": {
              "(EF08LP01) Identificar e comparar as várias editorias de jornais impressos e digitais e de sites noticiosos, de forma a refletir sobre os tipos de fato que são noticiados e comentados, as escolhas sobre o que noticiar e o que não noticiar e o destaque/enfoque dado e a fidedignidade da informação.": [
                {
                  "codigo": "EF09LP01",
                  "descricao": "Analisar o fenômeno da disseminação de notícias falsas nas redes sociais e desenvolver estratégias para reconhecê-las, a partir da verificação/avaliação do veículo, fonte, data e local da publicação, autoria, URL, da análise da formatação, da comparação de diferentes fontes, da consulta a sites de curadoria que atestam a fidedignidade do relato dos fatos e denunciam boatos etc."
                }
              ],
              "(EF08LP02) Justificar diferenças ou semelhanças no tratamento dado a uma mesma informação veiculada em textos diferentes, consultando sites e serviços de checadores de fatos.": [
                {
                  "codigo": "EF09LP02",
                  "descricao": "Analisar e comentar a cobertura da imprensa sobre fatos de relevância social, comparando diferentes enfoques por meio do uso de ferramentas de curadoria."
                }
              ]
            },
            "Produção de textos": {
              "(EF08LP03) Produzir artigos de opinião, tendo em vista o contexto de produção dado, a defesa de um ponto de vista, utilizando argumentos e contra-argumentos e articuladores de coesão que marquem relações de oposição, contraste, exemplificação, ênfase.": [
                {
                  "codigo": "EF09LP03",
                  "descricao": "Produzir artigos de opinião, tendo em vista o contexto de produção dado, assumindo posição diante de tema polêmico, argumentando de acordo com a estrutura própria desse tipo de texto e utilizando diferentes tipos de argumentos – de autoridade, comprovação, exemplificação princípio etc."
                }
              ]
            },
            "Análise linguística/ semiótica": {
              "(EF08LP04) Utilizar, ao produzir texto, conhecimentos linguísticos e gramaticais: ortografia, regências e concordâncias nominal e verbal, modos e tempos verbais, pontuação etc.": [
                {
                  "codigo": "EF09LP04",
                  "descricao": "Escrever textos corretamente, de acordo com a norma-padrão, com estruturas sintáticas complexas no nível da oração e do período."
                }
              ],
              "(EF08LP06) Identificar, em textos lidos ou de produção própria, os termos constitutivos da oração (sujeito e seus modificadores, verbo e seus complementos e modificadores).": [
                {
                  "codigo": "EF09LP05",
                  "descricao": "Identificar, em textos lidos e em produções próprias, orações com a estrutura sujeito-verbo de ligação-predicativo."
                }
              ],
              "(EF08LP07) Diferenciar, em textos lidos ou de produção própria, complementos diretos e indiretos de verbos transitivos, apropriando-se da regência de verbos de uso frequente.": [
                {
                  "codigo": "EF09LP06",
                  "descricao": "Diferenciar, em textos lidos e em produções próprias, o efeito de sentido do uso dos verbos de ligação “ser”, “estar”, “ficar”, “parecer” e “permanecer”."
                }
              ],
              "(EF08LP08) Identificar, em textos lidos ou de produção própria, verbos na voz ativa e na voz passiva, interpretando os efeitos de sentido de sujeito ativo e passivo (agente da passiva).": [
                {
                  "codigo": "EF09LP07",
                  "descricao": "Comparar o uso de regência verbal e regência nominal na norma-padrão com seu uso no português brasileiro coloquial oral."
                }
              ],
              "(EF08LP12) Identificar, em textos lidos, orações subordinadas com conjunções de uso frequente, incorporando-as às suas próprias produções.": [
                {
                  "codigo": "EF09LP08",
                  "descricao": "Identificar, em textos lidos e em produções próprias, a relação que conjunções (e locuções conjuntivas) coordenativas e subordinativas estabelecem entre as orações que conectam."
                }
              ]
            },
            "Análise linguística/semiótica": {
              "8o ANO": [
                {
                  "codigo": "EF09LP09",
                  "descricao": "Identificar efeitos de sentido do uso de orações adjetivas restritivas e explicativas em um período composto."
                }
              ],
              "(EF08LP15) Estabelecer relações entre partes do texto, identificando o antecedente de um pronome relativo ou o referente comum de uma cadeia de substituições lexicais.": [
                {
                  "codigo": "EF09LP10",
                  "descricao": "Comparar as regras de colocação pronominal na norma-padrão com o seu uso no português brasileiro coloquial."
                },
                {
                  "codigo": "EF09LP11",
                  "descricao": "Inferir efeitos de sentido decorrentes do uso de recursos de coesão sequencial (conjunções e articuladores textuais)."
                }
              ],
              "(EF89LP37) Analisar os efeitos de sentido do uso de figuras de linguagem como ironia, eufemismo, antítese, aliteração, assonância, dentre outras.": [
                {
                  "codigo": "EF09LP12",
                  "descricao": "Identificar estrangeirismos, caracterizando-os segundo a conservação, ou não, de sua forma gráfica de origem, avaliando a pertinência, ou não, de seu uso."
                }
              ]
            }
          }
        }
      },
      "Arte": {
        "competencias_especificas_componente": [],
        "anos": {}
      },
      "Educação Física": {
        "competencias_especificas_componente": [],
        "anos": {}
      },
      "Língua Inglesa": {
        "competencias_especificas_componente": [],
        "anos": {}
      }
    }
  },
  "Matemática": {
    "competencias_especificas_area": [],
    "componentes": {
      "Matemática": {
        "competencias_especificas_componente": [],
        "anos": {}
      }
    }
  },
  "Ciências da Natureza": {
    "competencias_especificas_area": [],
    "componentes": {
      "Ciências": {
        "competencias_especificas_componente": [],
        "anos": {}
      }
    }
  },
  "Ciências Humanas": {
    "competencias_especificas_area": [],
    "componentes": {
      "Geografia": {
        "competencias_especificas_componente": [],
        "anos": {}
      },
      "História": {
        "competencias_especificas_componente": [],
        "anos": {}
      }
    }
  },
  "Ensino Religioso": {
    "competencias_especificas_area": [],
    "componentes": {
      "Ensino Religioso": {
        "competencias_especificas_componente": [],
        "anos": {}
      }
    }
  }
}